#-*- coding: utf-8 -*-　
CardIndex = {   '白'  : 0, '中'  : 10, '發'  : 20,
                '一萬': 1, '一條': 11, '一餅': 21,
                '二萬': 2, '二條': 12, '二餅': 22,
                '三萬': 3, '三條': 13, '三餅': 23,
                '四萬': 4, '四條': 14, '四餅': 24,
                '五萬': 5, '五條': 15, '五餅': 25,
                '六萬': 6, '六條': 16, '六餅': 26,
                '七萬': 7, '七條': 17, '七餅': 27,
                '八萬': 8, '八條': 18, '八餅': 28,
                '九萬': 9, '九條': 19, '九餅': 29,

                '東':30,'西':31,'南':32,'北':33,
                '春':34,'夏':35,'秋':36,'冬':37,
                '梅':38,'蘭':39,'竹':40,'菊':41,
                None:42
                }

PlayerAction = {'Throw':0,
                'Pass' :1,
                '吃'   :2,
                '碰'   :3,
                '槓'   :4
                }

if __name__=='__main__':
    print len(CardIndex)

